---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizes.GetBasicIEnumerator
source: html/5402fcc5-882b-1eb9-72e2-76b376d5f412.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizes.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.